{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFC"
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<eos>": 2,
      "<bos>": 3,
      "!": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      ":": 18,
      ";": 19,
      "?": 20,
      "_": 21,
      "a": 22,
      "b": 23,
      "c": 24,
      "d": 25,
      "e": 26,
      "f": 27,
      "g": 28,
      "h": 29,
      "i": 30,
      "j": 31,
      "k": 32,
      "l": 33,
      "m": 34,
      "n": 35,
      "o": 36,
      "p": 37,
      "q": 38,
      "r": 39,
      "s": 40,
      "t": 41,
      "u": 42,
      "v": 43,
      "w": 44,
      "x": 45,
      "y": 46,
      "z": 47,
      "¡": 48,
      "¢": 49,
      "£": 50,
      "¤": 51,
      "¥": 52,
      "¦": 53,
      "§": 54,
      "¨": 55,
      "©": 56,
      "ª": 57,
      "«": 58,
      "¬": 59,
      "®": 60,
      "¯": 61,
      "°": 62,
      "±": 63,
      "²": 64,
      "³": 65,
      "´": 66,
      "µ": 67,
      "¶": 68,
      "·": 69,
      "¸": 70,
      "¹": 71,
      "º": 72,
      "»": 73,
      "¼": 74,
      "½": 75,
      "¾": 76,
      "¿": 77,
      "Â": 78,
      "Ã": 79,
      "Ä": 80,
      "Å": 81,
      "Æ": 82,
      "Ç": 83,
      "È": 84,
      "É": 85,
      "Ê": 86,
      "Ë": 87,
      "Ì": 88,
      "Î": 89,
      "Ï": 90,
      "Ð": 91,
      "Ñ": 92,
      "Ò": 93,
      "Õ": 94,
      "Ö": 95,
      "×": 96,
      "Ø": 97,
      "Ù": 98,
      "Ú": 99,
      "Û": 100,
      "Ü": 101,
      "à": 102,
      "á": 103,
      "ã": 104,
      "ä": 105,
      "å": 106,
      "æ": 107,
      "ç": 108,
      "è": 109,
      "é": 110,
      "ê": 111,
      "ë": 112,
      "ì": 113,
      "í": 114,
      "Ċ": 115,
      "Ġ": 116,
      "Ģ": 117,
      "ģ": 118,
      "Ĥ": 119,
      "ĥ": 120,
      "Ħ": 121,
      "ħ": 122,
      "Ĩ": 123,
      "ĩ": 124,
      "Ī": 125,
      "ī": 126,
      "Ĭ": 127,
      "ĭ": 128,
      "Į": 129,
      "į": 130,
      "İ": 131,
      "ı": 132,
      "Ĳ": 133,
      "ĳ": 134,
      "Ĵ": 135,
      "ĵ": 136,
      "Ķ": 137,
      "ķ": 138,
      "ĸ": 139,
      "Ĺ": 140,
      "ĺ": 141,
      "Ļ": 142,
      "ļ": 143,
      "Ľ": 144,
      "ľ": 145,
      "Ŀ": 146,
      "ŀ": 147,
      "Ł": 148,
      "ł": 149,
      "Ń": 150
    },
    "merges": []
  }
}